Repository: YasinRoshdy/YasinRoshdy
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Mark selected as published
ar: اجعل العناصر المحدده منشورة

source: Mark selected as not published
ar: اجعل العناصر المحدده غير منشورة

source: about_sheikh_short
ar: نبذة مختصرة عن الشيخ

source: about_mousa_short
ar: نبذة مخصترة عن الجمعية

source: privacy policy
ar: سياسة الخصوصية

source: tafsir_ayat_text
ar: نص تفسير الأيات

source: tafsir_hadith_text
ar: نص شرح الحديث

source: kb
ar: كيلو بايت

source: mb
ar: ميجا بايت

source: gb
ar: جيجا بايت

source: Published
ar: منشور

source: Not Published
ar: غير منشور

source: quran
ar: القرآن الكريم

source: AlHadith
ar: الحديث الشريف

source: OtherScience
ar: العلوم الأخرى

source: pillars
ar: الإسلا م و أركانه

source: aya
ar: آية

source: hadith
ar: حديث

source: fatwa
ar: فتوى

source: part of book
ar: فقرة من كتاب

source: book
ar: كتاب

source: artical
ar: المقال

source: video
ar: فيديو

source: audio
ar: ملف صوتى

source: Makkah
ar: مكة

source: Medina
ar: المدينة

source: telephon
ar: تيليفون

source: mobile
ar: موبايل

source: fax
ar: فاكس

source: site
ar: الموقع

source: name
ar: الاسم

source: words
ar: كلمات بسيطة

source: RelatedSites
ar: مواقع ذات صلة

source: phone_number
ar: رقم الهاتف

source: type
ar: نوع

source: phone numbers
ar: أرقام الهاتف

source: email
ar: البريد الالكترونى

source: instagram_link
ar: رابط الانسجرام

source: facebook_link
ar: رابط الفيسبوك

source: twitter_link
ar: رابط تويتر

source: youtube_link
ar: رابط يوتيوب

source: google_play_link
ar: رابط تطبيق Android

source: app_store_link
ar: رابط تطبيق IOS

source: about_sheikh
ar: عن الشيخ

source: about_mousa
ar: عن الجمعية

source: sheikh image about us
ar: صورة الشيخ فى صفحة بنذة عنا

source: mousa image about us
ar: صورة الجمعية فى صفحة بنذة عنا

source: home
ar: الرئيسية

source: message
ar: الرسالة

source: calledUs
ar: التواصل معنا

source: publish_type
ar: نوع المنشور

source: content
ar: محتوى

source: sura
ar: سورة

source: ayat
ar: أيات

source: AlHadith/AlSaheh/books
ar: الكتب/صحيح البخارى

source: ChapterInAlSaheh
ar: الباب/صحيح البخارى

source: display date
ar: عرض البيانات

source: publish status
ar: حالة النشر

source: Daily publishes
ar: النشر اليومى

source: title
ar: العنوان

source: file
ar: الملف

source: fatwa_text
ar: نص الفتوى

source: Fatwas
ar: الفتاوى

source: cover
ar: الصوره

source: page_count
ar: عدد الصفحات

source: books and articles
ar: الكتب والمقالات

source: key search
ar: البحث

source: BookInAlSaheh
ar: كتاب فى صحيح البخارى

source: Book Index
ar: فهارس الكتب

source: subjects
ar: مواضيع

source: file_type
ar: نوع الملف

source: order
ar: ترتيب

source: OtherScienceSubject
ar: مواضيع العلوم الأخرى

source: active flag
ar: تنشيط العنصر

source: SessionsCategory
ar: أنواع المجالس

source: Content
ar: المحتوى

source: category
ar: الأنواع

source: Sessions
ar: المجالس

source: sessions
ar: مجالس

source: tafsir_aya_start
ar: بدايه تفسير الأيات من آية رقم

source: tafsir_aya_end
ar: نهاية تفسير الأيات آية رقم

source: telawa
ar: التلاوة

source: sound_tafsir
ar: التفسير الصوتى

source: audio_tafsir
ar: التفسير الصوتى

source: video_tafsir_file
ar: ملف التفسير المرئى

source: video_url
ar: رابط الفيديو

source: tanzil_location
ar: مكان التنزيل

source: number
ar: رقم

source: ayas_count
ar: عدد الأيات

source: Quran Tafsir and Telawa
ar: تفسير القرآن والتلاوة

source: Sura
ar: السورة

source: aya_count
ar: رقم الأية

source: text
ar: النص

source: text without tashkel
ar: النص بدون تشكيل

source: Ayats
ar: الأيات

source: video_tafsir
ar: التفسير المرئى

source: Hadith
ar: الحديث الشريف

source: hadith in Al Saheh
ar: الحديث فى صحيح البخارى

source: chapter name
ar: أسم الباب

source: without tashkel
ar: بدون تشكيل

source: book name
ar: اسم الكتاب

source: message send successfully
ar: تم ارسال الرسالة بنجاح

source: data is not valid
ar: البيانات المرسلة غير صحيحة تأكد من البيانات قبل الارسال

source: call us
ar: اتصل بنا

source: Readed Tafsir
ar: التفسير المقروء

source: AlHadith/AlSaheh
ar: الحديث الشريف / صحيح البخارى

source: Files and Directory's
ar: الملفات و المجلدات

source: BASE
ar: الأساسى

source: Al Mouassa
ar: المواساة

source: Features area
ar: الخصائص

source: Al Mouassa Site Admin
ar: صفحه التحكم

source: admin
ar: المستخدم الرئيسي

source: Run the selected action
ar: تنفيذ الاجرائات المختارة

source: publish
ar: انشر

source: cancel publish
ar: الغاء النشر

source: Click here to select the objects across all pages
ar: اضغط هنا لاختيار العنصر فى كل الصفح

source: Clear selection
ar: الغاء الاختيار

source: Welcome,
ar: مرحبا

source: View site
ar: الموقع

source: Documentation
ar: الوثائق" "

source: Change password
ar: تغير كلمة المرور

source: Log out
ar: تسجيل الخروج

source: Home
ar: الصفحة الرئيسية

source: History
ar: التاريخ

source: View on site
ar: الموقع

source: Django Administration
ar: صفحة التحكم

source: Open
ar: أفتح

source: Email is required
ar: يجب ادخال بريد الكترونى صحيح

source: Message is required
ar: يجب ادخال الرسالة

source: send
ar: ارسال

source: download
ar: تحميل

source: AlSaheh
ar: صحيح البخارى

source: chapter
ar: باب

source: suras
ar: السور

source: related sites
ar: مواقع ذات صلة

source: books in AlSaheh
ar: الكتب فى صحيح البخارى

source: Advaced Search
ar: البحث المتقدم
