import json
import os
from pathlib import Path
from typing import Set

from base.management.commands.help import check_file_and_delete, mwasa_data_import
from base.management.commands.import_filer import AUDIOS, VIDEOS, get_path_audio, get_path_video, import_file

from base.models import Ayat, BookInAlSaheh, ChapterInAlSaheh, Hadith, TafsirHadithInAlSaheh
from django.core.management.base import BaseCommand
from mwasa2.settings import BASE_DIR


{
    "id": "6",
    "sndFile": "bokh00006",
    "hadeeth": "( 7 ) حَدَّثَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ فِي رَكْبٍ مِنْ قُرَيْشٍ وَكَانُوا تِجَارًا بِالشَّأْمِ فِي الْمُدَّةِ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَادَّ فِيهَا أَبَا سُفْيَانَ وَكُفَّارَ قُرَيْشٍ فَأَتَوْهُ وَهُمْ بِإِيلِيَاءَ فَدَعَاهُمْ فِي مَجْلِسِهِ وَحَوْلَهُ عُظَمَاءُ الرُّومِ ثُمَّ دَعَاهُمْ وَدَعَا بِتَرْجُمَانِهِ فَقَالَ أَيُّكُمْ أَقْرَبُ نَسَبًا بِهَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ فَقَالَ أَبُو سُفْيَانَ فَقُلْتُ أَنَا أَقْرَبُهُمْ نَسَبًا فَقَالَ أَدْنُوهُ مِنِّي وَقَرِّبُوا أَصْحَابَهُ فَاجْعَلُوهُمْ عِنْدَ ظَهْرِهِ ثُمَّ قَالَ لِتَرْجُمَانِهِ قُلْ لَهُمْ إِنِّي سَائِلٌ هَذَا عَنْ هَذَا الرَّجُلِ فَإِنْ كَذَبَنِي فَكَذِّبُوهُ فَوَاللَّهِ لَوْلَا الْحَيَاءُ مِنْ أَنْ يَأْثِرُوا عَلَيَّ كَذِبًا لَكَذَبْتُ عَنْهُ ثُمَّ كَانَ أَوَّلَ مَا سَأَلَنِي عَنْهُ أَنْ قَالَ كَيْفَ نَسَبُهُ فِيكُمْ قُلْتُ هُوَ فِينَا ذُو نَسَبٍ قَالَ فَهَلْ قَالَ هَذَا الْقَوْلَ مِنْكُمْ أَحَدٌ قَطُّ قَبْلَهُ قُلْتُ لَا قَالَ فَهَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ لَا قَالَ فَأَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ فَقُلْتُ بَلْ ضُعَفَاؤُهُمْ قَالَ أَيَزِيدُونَ أَمْ يَنْقُصُونَ قُلْتُ بَلْ يَزِيدُونَ قَالَ فَهَلْ يَرْتَدُّ أَحَدٌ مِنْهُمْ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ قُلْتُ لَا قَالَ فَهَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ قُلْتُ لَا قَالَ فَهَلْ يَغْدِرُ قُلْتُ لَا وَنَحْنُ مِنْهُ فِي مُدَّةٍ لَا نَدْرِي مَا هُوَ فَاعِلٌ فِيهَا قَالَ وَلَمْ تُمْكِنِّي كَلِمَةٌ أُدْخِلُ فِيهَا شَيْئًا غَيْرُ هَذِهِ الْكَلِمَةِ قَالَ فَهَلْ قَاتَلْتُمُوهُ قُلْتُ نَعَمْ قَالَ فَكَيْفَ كَانَ قِتَالُكُمْ إِيَّاهُ قُلْتُ الْحَرْبُ بَيْنَنَا وَبَيْنَهُ سِجَالٌ يَنَالُ مِنَّا وَنَنَالُ مِنْهُ قَالَ مَاذَا يَأْمُرُكُمْ قُلْتُ يَقُولُ اعْبُدُوا اللَّهَ وَحْدَهُ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَاتْرُكُوا مَا يَقُولُ آبَاؤُكُمْ وَيَأْمُرُنَا بِالصَّلَاةِ وَالزَّكَاةِ وَالصِّدْقِ وَالْعَفَافِ وَالصِّلَةِ فَقَالَ لِلتَّرْجُمَانِ قُلْ لَهُ سَأَلْتُكَ عَنْ نَسَبِهِ فَذَكَرْتَ أَنَّهُ فِيكُمْ ذُو نَسَبٍ فَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي نَسَبِ قَوْمِهَا وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ مِنْكُمْ هَذَا الْقَوْلَ فَذَكَرْتَ أَنْ لَا فَقُلْتُ لَوْ كَانَ أَحَدٌ قَالَ هَذَا الْقَوْلَ قَبْلَهُ لَقُلْتُ رَجُلٌ يَأْتَسِي بِقَوْلٍ قِيلَ قَبْلَهُ وَسَأَلْتُكَ هَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ فَذَكَرْتَ أَنْ لَا قُلْتُ فَلَوْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ رَجُلٌ يَطْلُبُ مُلْكَ أَبِيهِ وَسَأَلْتُكَ هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ فَذَكَرْتَ أَنْ لَا فَقَدْ أَعْرِفُ أَنَّهُ لَمْ يَكُنْ لِيَذَرَ الْكَذِبَ عَلَى النَّاسِ وَيَكْذِبَ عَلَى اللَّهِ وَسَأَلْتُكَ أَشْرَافُ النَّاسِ اتَّبَعُوهُ أَمْ ضُعَفَاؤُهُمْ فَذَكَرْتَ أَنَّ ضُعَفَاءَهُمْ اتَّبَعُوهُ وَهُمْ أَتْبَاعُ الرُّسُلِ وَسَأَلْتُكَ أَيَزِيدُونَ أَمْ يَنْقُصُونَ فَذَكَرْتَ أَنَّهُمْ يَزِيدُونَ وَكَذَلِكَ أَمْرُ الْإِيمَانِ حَتَّى يَتِمَّ وَسَأَلْتُكَ أَيَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ فَذَكَرْتَ أَنْ لَا وَكَذَلِكَ الْإِيمَانُ حِينَ تُخَالِطُ بَشَاشَتُهُ الْقُلُوبَ وَسَأَلْتُكَ هَلْ يَغْدِرُ فَذَكَرْتَ أَنْ لَا وَكَذَلِكَ الرُّسُلُ لَا تَغْدِرُ وَسَأَلْتُكَ بِمَا يَأْمُرُكُمْ فَذَكَرْتَ أَنَّهُ يَأْمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَيَنْهَاكُمْ عَنْ عِبَادَةِ الْأَوْثَانِ وَيَأْمُرُكُمْ بِالصَّلَاةِ وَالصِّدْقِ وَالْعَفَافِ فَإِنْ كَانَ مَا تَقُولُ حَقًّا فَسَيَمْلِكُ مَوْضِعَ قَدَمَيَّ هَاتَيْنِ وَقَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ لَمْ أَكُنْ أَظُنُّ أَنَّهُ مِنْكُمْ فَلَوْ أَنِّي أَعْلَمُ أَنِّي أَخْلُصُ إِلَيْهِ لَتَجَشَّمْتُ لِقَاءَهُ وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ عَنْ قَدَمِهِ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي بَعَثَ بِهِ دِحْيَةُ إِلَى عَظِيمِ بُصْرَى فَدَفَعَهُ إِلَى هِرَقْلَ فَقَرَأَهُ فَإِذَا فِيهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ إِلَى هِرَقْلَ عَظِيمِ الرُّومِ سَلَامٌ عَلَى مَنْ اتَّبَعَ الْهُدَى أَمَّا بَعْدُ فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الْإِسْلَامِ أَسْلِمْ تَسْلَمْ يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الْأَرِيسِيِّينَ وَ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لَا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ قَالَ أَبُو سُفْيَانَ فَلَمَّا قَالَ مَا قَالَ وَفَرَغَ مِنْ قِرَاءَةِ الْكِتَابِ كَثُرَ عِنْدَهُ الصَّخَبُ وَارْتَفَعَتْ الْأَصْوَاتُ وَأُخْرِجْنَا فَقُلْتُ لِأَصْحَابِي حِينَ أُخْرِجْنَا لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ إِنَّهُ يَخَافُهُ مَلِكُ بَنِي الْأَصْفَرِ فَمَا زِلْتُ مُوقِنًا أَنَّهُ سَيَظْهَرُ حَتَّى أَدْخَلَ اللَّهُ عَلَيَّ الْإِسْلَامَ وَكَانَ ابْنُ النَّاظُورِ صَاحِبُ إِيلِيَاءَ وَهِرَقْلَ سُقُفًّا عَلَى نَصَارَى الشَّأْمِ يُحَدِّثُ أَنَّ هِرَقْلَ حِينَ قَدِمَ إِيلِيَاءَ أَصْبَحَ يَوْمًا خَبِيثَ النَّفْسِ فَقَالَ بَعْضُ بَطَارِقَتِهِ قَدْ اسْتَنْكَرْنَا هَيْئَتَكَ قَالَ ابْنُ النَّاظُورِ وَكَانَ هِرَقْلُ حَزَّاءً يَنْظُرُ فِي النُّجُومِ فَقَالَ لَهُمْ حِينَ سَأَلُوهُ إِنِّي رَأَيْتُ اللَّيْلَةَ حِينَ نَظَرْتُ فِي النُّجُومِ مَلِكَ الْخِتَانِ قَدْ ظَهَرَ فَمَنْ يَخْتَتِنُ مِنْ هَذِهِ الْأُمَّةِ قَالُوا لَيْسَ يَخْتَتِنُ إِلَّا الْيَهُودُ فَلَا يُهِمَّنَّكَ شَأْنُهُمْ وَاكْتُبْ إِلَى مَدَايِنِ مُلْكِكَ فَيَقْتُلُوا مَنْ فِيهِمْ مِنْ الْيَهُودِ فَبَيْنَمَا هُمْ عَلَى أَمْرِهِمْ أُتِيَ هِرَقْلُ بِرَجُلٍ أَرْسَلَ بِهِ مَلِكُ غَسَّانَ يُخْبِرُ عَنْ خَبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا اسْتَخْبَرَهُ هِرَقْلُ قَالَ اذْهَبُوا فَانْظُرُوا أَمُخْتَتِنٌ هُوَ أَمْ لَا فَنَظَرُوا إِلَيْهِ فَحَدَّثُوهُ أَنَّهُ مُخْتَتِنٌ وَسَأَلَهُ عَنْ الْعَرَبِ فَقَالَ هُمْ يَخْتَتِنُونَ فَقَالَ هِرَقْلُ هَذَا مُلْكُ هَذِهِ الْأُمَّةِ قَدْ ظَهَرَ ثُمَّ كَتَبَ هِرَقْلُ إِلَى صَاحِبٍ لَهُ بِرُومِيَةَ وَكَانَ نَظِيرَهُ فِي الْعِلْمِ وَسَارَ هِرَقْلُ إِلَى حِمْصَ فَلَمْ يَرِمْ حِمْصَ حَتَّى أَتَاهُ كِتَابٌ مِنْ صَاحِبِهِ يُوَافِقُ رَأْيَ هِرَقْلَ عَلَى خُرُوجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَّهُ نَبِيٌّ فَأَذِنَ هِرَقْلُ لِعُظَمَاءِ الرُّومِ فِي دَسْكَرَةٍ لَهُ بِحِمْصَ ثُمَّ أَمَرَ بِأَبْوَابِهَا فَغُلِّقَتْ ثُمَّ اطَّلَعَ فَقَالَ يَا مَعْشَرَ الرُّومِ هَلْ لَكُمْ فِي الْفَلَاحِ وَالرُّشْدِ وَأَنْ يَثْبُتَ مُلْكُكُمْ فَتُبَايِعُوا هَذَا النَّبِيَّ فَحَاصُوا حَيْصَةَ حُمُرِ الْوَحْشِ إِلَى الْأَبْوَابِ فَوَجَدُوهَا قَدْ غُلِّقَتْ فَلَمَّا رَأَى هِرَقْلُ نَفْرَتَهُمْ وَأَيِسَ مِنْ الْإِيمَانِ قَالَ رُدُّوهُمْ عَلَيَّ وَقَالَ إِنِّي قُلْتُ مَقَالَتِي آنِفًا أَخْتَبِرُ بِهَا شِدَّتَكُمْ عَلَى دِينِكُمْ فَقَدْ رَأَيْتُ فَسَجَدُوا لَهُ وَرَضُوا عَنْهُ فَكَانَ ذَلِكَ آخِرَ شَأْنِ هِرَقْلَ رَوَاهُ صَالِحُ بْنُ كَيْسَانَ وَيُونُسُ وَمَعْمَرٌ عَنْ الزُّهْرِيِّ ",
    "bab": "باب بدء الوحى",
    "ketab": "كتاب بَدءِ الوَحْى",
    "videoFile": "bokhV00006 - bokhV00007 - bokhV00008",
    "ketab_id": "1",
    "hadeethWithoutTashkeel": "( 7 ) حدثنا أبو اليمان الحكم بن نافع قال أخبرنا شعيب عن الزهري قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود أن عبد الله بن عباس أخبره أن أبا سفيان بن حرب أخبره أن هرقل أرسل إليه في ركب من قريش وكانوا تجارا بالشأم في المدة التي كان رسول الله صلى الله عليه وسلم ماد فيها أبا سفيان وكفار قريش فأتوه وهم بإيلياء فدعاهم في مجلسه وحوله عظماء الروم ثم دعاهم ودعا بترجمانه فقال أيكم أقرب نسبا بهذا الرجل الذي يزعم أنه نبي فقال أبو سفيان فقلت أنا أقربهم نسبا فقال أدنوه مني وقربوا أصحابه فاجعلوهم عند ظهره ثم قال لترجمانه قل لهم إني سائل هذا عن هذا الرجل فإن كذبني فكذبوه فوالله لولا الحياء من أن يأثروا علي كذبا لكذبت عنه ثم كان أول ما سألني عنه أن قال كيف نسبه فيكم قلت هو فينا ذو نسب قال فهل قال هذا القول منكم أحد قط قبله قلت لا قال فهل كان من آبائه من ملك قلت لا قال فأشراف الناس يتبعونه أم ضعفاؤهم فقلت بل ضعفاؤهم قال أيزيدون أم ينقصون قلت بل يزيدون قال فهل يرتد أحد منهم سخطة لدينه بعد أن يدخل فيه قلت لا قال فهل كنتم تتهمونه بالكذب قبل أن يقول ما قال قلت لا قال فهل يغدر قلت لا ونحن منه في مدة لا ندري ما هو فاعل فيها قال ولم تمكني كلمة أدخل فيها شيئا غير هذه الكلمة قال فهل قاتلتموه قلت نعم قال فكيف كان قتالكم إياه قلت الحرب بيننا وبينه سجال ينال منا وننال منه قال ماذا يأمركم قلت يقول اعبدوا الله وحده ولا تشركوا به شيئا واتركوا ما يقول آباؤكم ويأمرنا بالصلاة والزكاة والصدق والعفاف والصلة فقال للترجمان قل له سألتك عن نسبه فذكرت أنه فيكم ذو نسب فكذلك الرسل تبعث في نسب قومها وسألتك هل قال أحد منكم هذا القول فذكرت أن لا فقلت لو كان أحد قال هذا القول قبله لقلت رجل يأتسي بقول قيل قبله وسألتك هل كان من آبائه من ملك فذكرت أن لا قلت فلو كان من آبائه من ملك قلت رجل يطلب ملك أبيه وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فذكرت أن لا فقد أعرف أنه لم يكن ليذر الكذب على الناس ويكذب على الله وسألتك أشراف الناس اتبعوه أم ضعفاؤهم فذكرت أن ضعفاءهم اتبعوه وهم أتباع الرسل وسألتك أيزيدون أم ينقصون فذكرت أنهم يزيدون وكذلك أمر الإيمان حتى يتم وسألتك أيرتد أحد سخطة لدينه بعد أن يدخل فيه فذكرت أن لا وكذلك الإيمان حين تخالط بشاشته القلوب وسألتك هل يغدر فذكرت أن لا وكذلك الرسل لا تغدر وسألتك بما يأمركم فذكرت أنه يأمركم أن تعبدوا الله ولا تشركوا به شيئا وينهاكم عن عبادة الأوثان ويأمركم بالصلاة والصدق والعفاف فإن كان ما تقول حقا فسيملك موضع قدمي هاتين وقد كنت أعلم أنه خارج لم أكن أظن أنه منكم فلو أني أعلم أني أخلص إليه لتجشمت لقاءه ولو كنت عنده لغسلت عن قدمه ثم دعا بكتاب رسول الله صلى الله عليه وسلم الذي بعث به دحية إلى عظيم بصرى فدفعه إلى هرقل فقرأه فإذا فيه بسم الله الرحمن الرحيم من محمد عبد الله ورسوله إلى هرقل عظيم الروم سلام على من اتبع الهدى أما بعد فإني أدعوك بدعاية الإسلام أسلم تسلم يؤتك الله أجرك مرتين فإن توليت فإن عليك إثم الأريسيين و يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون قال أبو سفيان فلما قال ما قال وفرغ من قراءة الكتاب كثر عنده الصخب وارتفعت الأصوات وأخرجنا فقلت لأصحابي حين أخرجنا لقد أمر أمر ابن أبي كبشة إنه يخافه ملك بني الأصفر فما زلت موقنا أنه سيظهر حتى أدخل الله علي الإسلام وكان ابن الناظور صاحب إيلياء وهرقل سقفا على نصارى الشأم يحدث أن هرقل حين قدم إيلياء أصبح يوما خبيث النفس فقال بعض بطارقته قد استنكرنا هيئتك قال ابن الناظور وكان هرقل حزاء ينظر في النجوم فقال لهم حين سألوه إني رأيت الليلة حين نظرت في النجوم ملك الختان قد ظهر فمن يختتن من هذه الأمة قالوا ليس يختتن إلا اليهود فلا يهمنك شأنهم واكتب إلى مداين ملكك فيقتلوا من فيهم من اليهود فبينما هم على أمرهم أتي هرقل برجل أرسل به ملك غسان يخبر عن خبر رسول الله صلى الله عليه وسلم فلما استخبره هرقل قال اذهبوا فانظروا أمختتن هو أم لا فنظروا إليه فحدثوه أنه مختتن وسأله عن العرب فقال هم يختتنون فقال هرقل هذا ملك هذه الأمة قد ظهر ثم كتب هرقل إلى صاحب له برومية وكان نظيره في العلم وسار هرقل إلى حمص فلم يرم حمص حتى أتاه كتاب من صاحبه يوافق رأي هرقل على خروج النبي صلى الله عليه وسلم وأنه نبي فأذن هرقل لعظماء الروم في دسكرة له بحمص ثم أمر بأبوابها فغلقت ثم اطلع فقال يا معشر الروم هل لكم في الفلاح والرشد وأن يثبت ملككم فتبايعوا هذا النبي فحاصوا حيصة حمر الوحش إلى الأبواب فوجدوها قد غلقت فلما رأى هرقل نفرتهم وأيس من الإيمان قال ردوهم علي وقال إني قلت مقالتي آنفا أختبر بها شدتكم على دينكم فقد رأيت فسجدوا له ورضوا عنه فكان ذلك آخر شأن هرقل رواه صالح بن كيسان ويونس ومعمر عن الزهري ",
    "babWithoutTashkeel": "باب بدء الوحى",
    "ketabWithoutTashkeel": "كتاب بَدءِ الوَحْى",
    "hadeeth_order": "60",
    "YouTubeVideoID": "R2kbO-SAs5g,aVeEvBEV6no,2mcL268NHoc",
}

{
    "id": "2",
    "sndFile": "bokh00002",
    "hadeeth": "( 2 ) حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا أَنَّ الْحَارِثَ بْنَ هِشَامٍ رَضِيَ اللَّهُ عَنْهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْيُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ وَهُوَ أَشَدُّهُ عَلَيَّ فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ وَأَحْيَانًا يَتَمَثَّلُ لِي الْمَلَكُ رَجُلًا فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْيُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا",
    "bab": "باب بدء الوحى",
    "ketab": "كتاب بَدءِ الوَحْى",
    "videoFile": "bokhV00002",
    "ketab_id": "1",
    "hadeethWithoutTashkeel": "( 2 ) حدثنا عبد الله بن يوسف قال أخبرنا مالك عن هشام بن عروة عن أبيه عن عائشة أم المؤمنين رضي الله عنها أن الحارث بن هشام رضي الله عنه سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله كيف يأتيك الوحي فقال رسول الله صلى الله عليه وسلم أحيانا يأتيني مثل صلصلة الجرس وهو أشده علي فيفصم عني وقد وعيت عنه ما قال وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول قالت عائشة رضي الله عنها ولقد رأيته ينزل عليه الوحي في اليوم الشديد البرد فيفصم عنه وإن جبينه ليتفصد عرقا",
    "babWithoutTashkeel": "باب بدء الوحى",
    "ketabWithoutTashkeel": "كتاب بَدءِ الوَحْى",
    "hadeeth_order": "20",
    "YouTubeVideoID": "SMeM39yQSjI",
},

{
    "id": "1",
    "sndFile": "bokh00001",
    "hadeeth": "",
    "bab": "",
    "ketab": "كتاب بدء الوحى",
    "videoFile": "bokhV00001",
    "ketab_id": "1",
    "hadeethWithoutTashkeel": "بسم الله الرحمن الرحيم كتاب بدء الوحي باب بدء الوحي قال الشيخ الإمام الحافظ أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة البخاري رحمه الله تعالى آمين كيف كان بدء الوحي إلى رسول الله صلى الله عليه وسلم وقول الله جل ذكره إنا أوحينا إليك كما أوحينا إلى نوح والنبيين من بعده ( 1 ) حدثنا الحميدي عبد الله بن الزبير قال حدثنا سفيان قال حدثنا يحيى بن سعيد الأنصاري قال أخبرني محمد بن إبراهيم التيمي أنه سمع علقمة بن وقاص الليثي يقول سمعت عمر بن الخطاب رضي الله عنه على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول إنما الأعمال بالنيات وإنما لكل امرئ ما نوى فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه",
    "babWithoutTashkeel": "باب بدء الوحى",
    "ketabWithoutTashkeel": "كتاب بدء الوحى",
    "hadeeth_order": "10",
    "YouTubeVideoID": "3GuEnz66GjI",
}

{
    "id": "7831",
    "sndFile": "bokh04999",
    "hadeeth": "",
    "bab": "",
    "ketab": "",
    "videoFile": "https:\/\/www.youtube.com\/watch?v=Q9bofViQs38&featur",
    "ketab_id": "4999",
    "hadeethWithoutTashkeel": "مقدمة في علم الحديث ",
    "babWithoutTashkeel": "مقدمة في علم الحديث ",
    "ketabWithoutTashkeel": "مقدمة في علم الحديث ",
    "hadeeth_order": "79999",
    "YouTubeVideoID": "",
},
{
    "id": "7832",
    "sndFile": "bokh00000",
    "hadeeth": "مقدمة في علم الحديث",
    "bab": "0",
    "ketab": "مقدمة في علم الحديث",
    "videoFile": "bokhV00000",
    "ketab_id": "0",
    "hadeethWithoutTashkeel": "مقدمة في علم الحديث",
    "babWithoutTashkeel": "مقدمة في علم الحديث",
    "ketabWithoutTashkeel": "مقدمة في علم الحديث",
    "hadeeth_order": "79998",
    "YouTubeVideoID": "Q9bofViQs38",
}
# ALBOKHARY = "Albokhary"


def get_path_audio_Albokhary_file(file_name):
    return get_path_audio().joinpath("Albokhary").joinpath(file_name)


def get_path_video_Albokhary_file(file_name):
    return get_path_video().joinpath("Albokhary").joinpath(file_name)


def get_path_audio_Albokhary_file(file_name):
    return get_path_audio().joinpath("Albokhary").joinpath(file_name)


def handle_file(data, parent: list):
    file = data["videoFile"]
    youtube = data["YouTubeVideoID"]

    if "https" in file:
        tmp = file
        file = youtube
        youtube = tmp
    # Audios/Telawa/telwa147.mp3

    return [file, youtube]


def handle_bukkhari():
    bukkhari = open(mwasa_data_import().joinpath("bukkhari").joinpath("bukkhari.json"), encoding="utf-8")
    data = json.load(bukkhari)
    data = data[2]["data"]
    books = {}
    babs = []
    hadith_lista = []
    tafsir_hadith_lista = []
    chapter_intro = ChapterInAlSaheh.objects.filter(id=1).first()
    book_intro = BookInAlSaheh.objects.filter(id=1).first()
    chapter_intro.name = "مقدمة في علم الحديث"
    chapter_intro.name_without_tashkil = "مقدمة في علم الحديث"
    chapter_intro.save()
    for _ in data:
        bab_name = _["bab"] if _["bab"] else _["babWithoutTashkeel"]

        chapter = ChapterInAlSaheh.objects.filter(name=bab_name).first()
        if not chapter:
            print(_)
        else:
            if not chapter.name_without_tashkil:

                chapter.name_without_tashkil = _["babWithoutTashkeel"] if _["babWithoutTashkeel"] else _["bab"]
                babs.append(chapter)

        had_text = _["hadeeth"] if _["hadeeth"] else _["hadeethWithoutTashkeel"]

        hadith = Hadith(
            id=int(_["id"]),
            text=had_text,
            text_without_tashkil=_["hadeethWithoutTashkeel"],
            number=int(_["hadeeth_order"]),
            book_id=int(_["ketab_id"]),
            chapter=chapter if chapter else chapter_intro,
        )
        # item_hadith_tafsir_list = []
        # files_lista = _["videoFile"].split("-")
        # url_lista = _["YouTubeVideoID"].split(",")
        # for file, url in zip(files_lista, url_lista):

        #     file_path_audio = get_path_audio_Albokhary_file(file)
        #     file_path_video = get_path_video_Albokhary_file(file)
        #     # for audio
        #     # foldor = ["parent", "child"]
        #     print("befor import_file audio", file, url, files_lista, url_lista)
        #     file_audio = import_file(file_path_audio, [Audios, "Albokhary"])
        #     # for video
        #     print("file_audio", file_audio)
        #     file_video = import_file(file_path_video, [VIDEOS, "Albokhary"])
        #     print("file_video", file_video)

        #     hadith_tafsir = TafsirHadithInAlSaheh(
        #         book_id=_["ketab_id"] if _["ketab_id"] else book_intro.id,
        #         chapter=chapter if chapter else chapter_intro,
        #         # hadith=hadith,
        #         video_url=url,
        #         video_tafsir=file_video,
        #         audio_tafsir_id=file_audio,
        #     )
        #     item_hadith_tafsir_list.append(hadith_tafsir)

        hadith_lista.append(hadith)
        # tafsir_hadith_lista.extend(item_hadith_tafsir_list)

    print("el" * 10)
    uniqe = []
    for el in hadith_lista:

        if el.id in uniqe:
            print(el)
        else:
            uniqe.append(el.id)

    #     # if not books.get(_["ketab"]):
    #     #     books[_["ketab"]] = BookInAlSaheh(id=_["ketab_id"], name=_["ketab"], name_without_tashkil=_["ketabWithoutTashkeel"])
    #     # if not babs.get(_["bab"]):
    #     #     babs[_["bab"]] = ChapterInAlSaheh(name=_["bab"], name_without_tashkil=_["babWithoutTashkeel"])

    # # ChapterInAlSaheh.objects.bulk_update(babs, ["name_without_tashkil"])
    Hadith.objects.bulk_create(hadith_lista)
    # # for item, idx in zip(hadith_lista, range(len(hadith_lista))):
    # #     try:
    # #         item.save()

    # #     except Exception as e:
    # #         print(idx)
    # #         raise e

    # # for had, had_tafsir in zip(hadith_lista, tafsir_hadith_lista):
    # #     had_tafsir.hadith = had
    # TafsirHadithInAlSaheh.objects.bulk_create(tafsir_hadith_lista)


{
    "id": "6",
    "sndFile": "bokh00006",
    "hadeeth": "( 7 ) حَدَّثَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ فِي رَكْبٍ مِنْ قُرَيْشٍ وَكَانُوا تِجَارًا بِالشَّأْمِ فِي الْمُدَّةِ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَادَّ فِيهَا أَبَا سُفْيَانَ وَكُفَّارَ قُرَيْشٍ فَأَتَوْهُ وَهُمْ بِإِيلِيَاءَ فَدَعَاهُمْ فِي مَجْلِسِهِ وَحَوْلَهُ عُظَمَاءُ الرُّومِ ثُمَّ دَعَاهُمْ وَدَعَا بِتَرْجُمَانِهِ فَقَالَ أَيُّكُمْ أَقْرَبُ نَسَبًا بِهَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ فَقَالَ أَبُو سُفْيَانَ فَقُلْتُ أَنَا أَقْرَبُهُمْ نَسَبًا فَقَالَ أَدْنُوهُ مِنِّي وَقَرِّبُوا أَصْحَابَهُ فَاجْعَلُوهُمْ عِنْدَ ظَهْرِهِ ثُمَّ قَالَ لِتَرْجُمَانِهِ قُلْ لَهُمْ إِنِّي سَائِلٌ هَذَا عَنْ هَذَا الرَّجُلِ فَإِنْ كَذَبَنِي فَكَذِّبُوهُ فَوَاللَّهِ لَوْلَا الْحَيَاءُ مِنْ أَنْ يَأْثِرُوا عَلَيَّ كَذِبًا لَكَذَبْتُ عَنْهُ ثُمَّ كَانَ أَوَّلَ مَا سَأَلَنِي عَنْهُ أَنْ قَالَ كَيْفَ نَسَبُهُ فِيكُمْ قُلْتُ هُوَ فِينَا ذُو نَسَبٍ قَالَ فَهَلْ قَالَ هَذَا الْقَوْلَ مِنْكُمْ أَحَدٌ قَطُّ قَبْلَهُ قُلْتُ لَا قَالَ فَهَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ لَا قَالَ فَأَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ فَقُلْتُ بَلْ ضُعَفَاؤُهُمْ قَالَ أَيَزِيدُونَ أَمْ يَنْقُصُونَ قُلْتُ بَلْ يَزِيدُونَ قَالَ فَهَلْ يَرْتَدُّ أَحَدٌ مِنْهُمْ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ قُلْتُ لَا قَالَ فَهَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ قُلْتُ لَا قَالَ فَهَلْ يَغْدِرُ قُلْتُ لَا وَنَحْنُ مِنْهُ فِي مُدَّةٍ لَا نَدْرِي مَا هُوَ فَاعِلٌ فِيهَا قَالَ وَلَمْ تُمْكِنِّي كَلِمَةٌ أُدْخِلُ فِيهَا شَيْئًا غَيْرُ هَذِهِ الْكَلِمَةِ قَالَ فَهَلْ قَاتَلْتُمُوهُ قُلْتُ نَعَمْ قَالَ فَكَيْفَ كَانَ قِتَالُكُمْ إِيَّاهُ قُلْتُ الْحَرْبُ بَيْنَنَا وَبَيْنَهُ سِجَالٌ يَنَالُ مِنَّا وَنَنَالُ مِنْهُ قَالَ مَاذَا يَأْمُرُكُمْ قُلْتُ يَقُولُ اعْبُدُوا اللَّهَ وَحْدَهُ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَاتْرُكُوا مَا يَقُولُ آبَاؤُكُمْ وَيَأْمُرُنَا بِالصَّلَاةِ وَالزَّكَاةِ وَالصِّدْقِ وَالْعَفَافِ وَالصِّلَةِ فَقَالَ لِلتَّرْجُمَانِ قُلْ لَهُ سَأَلْتُكَ عَنْ نَسَبِهِ فَذَكَرْتَ أَنَّهُ فِيكُمْ ذُو نَسَبٍ فَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي نَسَبِ قَوْمِهَا وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ مِنْكُمْ هَذَا الْقَوْلَ فَذَكَرْتَ أَنْ لَا فَقُلْتُ لَوْ كَانَ أَحَدٌ قَالَ هَذَا الْقَوْلَ قَبْلَهُ لَقُلْتُ رَجُلٌ يَأْتَسِي بِقَوْلٍ قِيلَ قَبْلَهُ وَسَأَلْتُكَ هَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ فَذَكَرْتَ أَنْ لَا قُلْتُ فَلَوْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ رَجُلٌ يَطْلُبُ مُلْكَ أَبِيهِ وَسَأَلْتُكَ هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ فَذَكَرْتَ أَنْ لَا فَقَدْ أَعْرِفُ أَنَّهُ لَمْ يَكُنْ لِيَذَرَ الْكَذِبَ عَلَى النَّاسِ وَيَكْذِبَ عَلَى اللَّهِ وَسَأَلْتُكَ أَشْرَافُ النَّاسِ اتَّبَعُوهُ أَمْ ضُعَفَاؤُهُمْ فَذَكَرْتَ أَنَّ ضُعَفَاءَهُمْ اتَّبَعُوهُ وَهُمْ أَتْبَاعُ الرُّسُلِ وَسَأَلْتُكَ أَيَزِيدُونَ أَمْ يَنْقُصُونَ فَذَكَرْتَ أَنَّهُمْ يَزِيدُونَ وَكَذَلِكَ أَمْرُ الْإِيمَانِ حَتَّى يَتِمَّ وَسَأَلْتُكَ أَيَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ فَذَكَرْتَ أَنْ لَا وَكَذَلِكَ الْإِيمَانُ حِينَ تُخَالِطُ بَشَاشَتُهُ الْقُلُوبَ وَسَأَلْتُكَ هَلْ يَغْدِرُ فَذَكَرْتَ أَنْ لَا وَكَذَلِكَ الرُّسُلُ لَا تَغْدِرُ وَسَأَلْتُكَ بِمَا يَأْمُرُكُمْ فَذَكَرْتَ أَنَّهُ يَأْمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَيَنْهَاكُمْ عَنْ عِبَادَةِ الْأَوْثَانِ وَيَأْمُرُكُمْ بِالصَّلَاةِ وَالصِّدْقِ وَالْعَفَافِ فَإِنْ كَانَ مَا تَقُولُ حَقًّا فَسَيَمْلِكُ مَوْضِعَ قَدَمَيَّ هَاتَيْنِ وَقَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ لَمْ أَكُنْ أَظُنُّ أَنَّهُ مِنْكُمْ فَلَوْ أَنِّي أَعْلَمُ أَنِّي أَخْلُصُ إِلَيْهِ لَتَجَشَّمْتُ لِقَاءَهُ وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ عَنْ قَدَمِهِ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي بَعَثَ بِهِ دِحْيَةُ إِلَى عَظِيمِ بُصْرَى فَدَفَعَهُ إِلَى هِرَقْلَ فَقَرَأَهُ فَإِذَا فِيهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ إِلَى هِرَقْلَ عَظِيمِ الرُّومِ سَلَامٌ عَلَى مَنْ اتَّبَعَ الْهُدَى أَمَّا بَعْدُ فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الْإِسْلَامِ أَسْلِمْ تَسْلَمْ يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الْأَرِيسِيِّينَ وَ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لَا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ قَالَ أَبُو سُفْيَانَ فَلَمَّا قَالَ مَا قَالَ وَفَرَغَ مِنْ قِرَاءَةِ الْكِتَابِ كَثُرَ عِنْدَهُ الصَّخَبُ وَارْتَفَعَتْ الْأَصْوَاتُ وَأُخْرِجْنَا فَقُلْتُ لِأَصْحَابِي حِينَ أُخْرِجْنَا لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ إِنَّهُ يَخَافُهُ مَلِكُ بَنِي الْأَصْفَرِ فَمَا زِلْتُ مُوقِنًا أَنَّهُ سَيَظْهَرُ حَتَّى أَدْخَلَ اللَّهُ عَلَيَّ الْإِسْلَامَ وَكَانَ ابْنُ النَّاظُورِ صَاحِبُ إِيلِيَاءَ وَهِرَقْلَ سُقُفًّا عَلَى نَصَارَى الشَّأْمِ يُحَدِّثُ أَنَّ هِرَقْلَ حِينَ قَدِمَ إِيلِيَاءَ أَصْبَحَ يَوْمًا خَبِيثَ النَّفْسِ فَقَالَ بَعْضُ بَطَارِقَتِهِ قَدْ اسْتَنْكَرْنَا هَيْئَتَكَ قَالَ ابْنُ النَّاظُورِ وَكَانَ هِرَقْلُ حَزَّاءً يَنْظُرُ فِي النُّجُومِ فَقَالَ لَهُمْ حِينَ سَأَلُوهُ إِنِّي رَأَيْتُ اللَّيْلَةَ حِينَ نَظَرْتُ فِي النُّجُومِ مَلِكَ الْخِتَانِ قَدْ ظَهَرَ فَمَنْ يَخْتَتِنُ مِنْ هَذِهِ الْأُمَّةِ قَالُوا لَيْسَ يَخْتَتِنُ إِلَّا الْيَهُودُ فَلَا يُهِمَّنَّكَ شَأْنُهُمْ وَاكْتُبْ إِلَى مَدَايِنِ مُلْكِكَ فَيَقْتُلُوا مَنْ فِيهِمْ مِنْ الْيَهُودِ فَبَيْنَمَا هُمْ عَلَى أَمْرِهِمْ أُتِيَ هِرَقْلُ بِرَجُلٍ أَرْسَلَ بِهِ مَلِكُ غَسَّانَ يُخْبِرُ عَنْ خَبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا اسْتَخْبَرَهُ هِرَقْلُ قَالَ اذْهَبُوا فَانْظُرُوا أَمُخْتَتِنٌ هُوَ أَمْ لَا فَنَظَرُوا إِلَيْهِ فَحَدَّثُوهُ أَنَّهُ مُخْتَتِنٌ وَسَأَلَهُ عَنْ الْعَرَبِ فَقَالَ هُمْ يَخْتَتِنُونَ فَقَالَ هِرَقْلُ هَذَا مُلْكُ هَذِهِ الْأُمَّةِ قَدْ ظَهَرَ ثُمَّ كَتَبَ هِرَقْلُ إِلَى صَاحِبٍ لَهُ بِرُومِيَةَ وَكَانَ نَظِيرَهُ فِي الْعِلْمِ وَسَارَ هِرَقْلُ إِلَى حِمْصَ فَلَمْ يَرِمْ حِمْصَ حَتَّى أَتَاهُ كِتَابٌ مِنْ صَاحِبِهِ يُوَافِقُ رَأْيَ هِرَقْلَ عَلَى خُرُوجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَّهُ نَبِيٌّ فَأَذِنَ هِرَقْلُ لِعُظَمَاءِ الرُّومِ فِي دَسْكَرَةٍ لَهُ بِحِمْصَ ثُمَّ أَمَرَ بِأَبْوَابِهَا فَغُلِّقَتْ ثُمَّ اطَّلَعَ فَقَالَ يَا مَعْشَرَ الرُّومِ هَلْ لَكُمْ فِي الْفَلَاحِ وَالرُّشْدِ وَأَنْ يَثْبُتَ مُلْكُكُمْ فَتُبَايِعُوا هَذَا النَّبِيَّ فَحَاصُوا حَيْصَةَ حُمُرِ الْوَحْشِ إِلَى الْأَبْوَابِ فَوَجَدُوهَا قَدْ غُلِّقَتْ فَلَمَّا رَأَى هِرَقْلُ نَفْرَتَهُمْ وَأَيِسَ مِنْ الْإِيمَانِ قَالَ رُدُّوهُمْ عَلَيَّ وَقَالَ إِنِّي قُلْتُ مَقَالَتِي آنِفًا أَخْتَبِرُ بِهَا شِدَّتَكُمْ عَلَى دِينِكُمْ فَقَدْ رَأَيْتُ فَسَجَدُوا لَهُ وَرَضُوا عَنْهُ فَكَانَ ذَلِكَ آخِرَ شَأْنِ هِرَقْلَ رَوَاهُ صَالِحُ بْنُ كَيْسَانَ وَيُونُسُ وَمَعْمَرٌ عَنْ الزُّهْرِيِّ ",
    "bab": "باب بدء الوحى",
    "ketab": "كتاب بَدءِ الوَحْى",
    "videoFile": "bokhV00006 - bokhV00007 - bokhV00008",
    "ketab_id": "1",
    "hadeethWithoutTashkeel": "( 7 ) حدثنا أبو اليمان الحكم بن نافع قال أخبرنا شعيب عن الزهري قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود أن عبد الله بن عباس أخبره أن أبا سفيان بن حرب أخبره أن هرقل أرسل إليه في ركب من قريش وكانوا تجارا بالشأم في المدة التي كان رسول الله صلى الله عليه وسلم ماد فيها أبا سفيان وكفار قريش فأتوه وهم بإيلياء فدعاهم في مجلسه وحوله عظماء الروم ثم دعاهم ودعا بترجمانه فقال أيكم أقرب نسبا بهذا الرجل الذي يزعم أنه نبي فقال أبو سفيان فقلت أنا أقربهم نسبا فقال أدنوه مني وقربوا أصحابه فاجعلوهم عند ظهره ثم قال لترجمانه قل لهم إني سائل هذا عن هذا الرجل فإن كذبني فكذبوه فوالله لولا الحياء من أن يأثروا علي كذبا لكذبت عنه ثم كان أول ما سألني عنه أن قال كيف نسبه فيكم قلت هو فينا ذو نسب قال فهل قال هذا القول منكم أحد قط قبله قلت لا قال فهل كان من آبائه من ملك قلت لا قال فأشراف الناس يتبعونه أم ضعفاؤهم فقلت بل ضعفاؤهم قال أيزيدون أم ينقصون قلت بل يزيدون قال فهل يرتد أحد منهم سخطة لدينه بعد أن يدخل فيه قلت لا قال فهل كنتم تتهمونه بالكذب قبل أن يقول ما قال قلت لا قال فهل يغدر قلت لا ونحن منه في مدة لا ندري ما هو فاعل فيها قال ولم تمكني كلمة أدخل فيها شيئا غير هذه الكلمة قال فهل قاتلتموه قلت نعم قال فكيف كان قتالكم إياه قلت الحرب بيننا وبينه سجال ينال منا وننال منه قال ماذا يأمركم قلت يقول اعبدوا الله وحده ولا تشركوا به شيئا واتركوا ما يقول آباؤكم ويأمرنا بالصلاة والزكاة والصدق والعفاف والصلة فقال للترجمان قل له سألتك عن نسبه فذكرت أنه فيكم ذو نسب فكذلك الرسل تبعث في نسب قومها وسألتك هل قال أحد منكم هذا القول فذكرت أن لا فقلت لو كان أحد قال هذا القول قبله لقلت رجل يأتسي بقول قيل قبله وسألتك هل كان من آبائه من ملك فذكرت أن لا قلت فلو كان من آبائه من ملك قلت رجل يطلب ملك أبيه وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فذكرت أن لا فقد أعرف أنه لم يكن ليذر الكذب على الناس ويكذب على الله وسألتك أشراف الناس اتبعوه أم ضعفاؤهم فذكرت أن ضعفاءهم اتبعوه وهم أتباع الرسل وسألتك أيزيدون أم ينقصون فذكرت أنهم يزيدون وكذلك أمر الإيمان حتى يتم وسألتك أيرتد أحد سخطة لدينه بعد أن يدخل فيه فذكرت أن لا وكذلك الإيمان حين تخالط بشاشته القلوب وسألتك هل يغدر فذكرت أن لا وكذلك الرسل لا تغدر وسألتك بما يأمركم فذكرت أنه يأمركم أن تعبدوا الله ولا تشركوا به شيئا وينهاكم عن عبادة الأوثان ويأمركم بالصلاة والصدق والعفاف فإن كان ما تقول حقا فسيملك موضع قدمي هاتين وقد كنت أعلم أنه خارج لم أكن أظن أنه منكم فلو أني أعلم أني أخلص إليه لتجشمت لقاءه ولو كنت عنده لغسلت عن قدمه ثم دعا بكتاب رسول الله صلى الله عليه وسلم الذي بعث به دحية إلى عظيم بصرى فدفعه إلى هرقل فقرأه فإذا فيه بسم الله الرحمن الرحيم من محمد عبد الله ورسوله إلى هرقل عظيم الروم سلام على من اتبع الهدى أما بعد فإني أدعوك بدعاية الإسلام أسلم تسلم يؤتك الله أجرك مرتين فإن توليت فإن عليك إثم الأريسيين و يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون قال أبو سفيان فلما قال ما قال وفرغ من قراءة الكتاب كثر عنده الصخب وارتفعت الأصوات وأخرجنا فقلت لأصحابي حين أخرجنا لقد أمر أمر ابن أبي كبشة إنه يخافه ملك بني الأصفر فما زلت موقنا أنه سيظهر حتى أدخل الله علي الإسلام وكان ابن الناظور صاحب إيلياء وهرقل سقفا على نصارى الشأم يحدث أن هرقل حين قدم إيلياء أصبح يوما خبيث النفس فقال بعض بطارقته قد استنكرنا هيئتك قال ابن الناظور وكان هرقل حزاء ينظر في النجوم فقال لهم حين سألوه إني رأيت الليلة حين نظرت في النجوم ملك الختان قد ظهر فمن يختتن من هذه الأمة قالوا ليس يختتن إلا اليهود فلا يهمنك شأنهم واكتب إلى مداين ملكك فيقتلوا من فيهم من اليهود فبينما هم على أمرهم أتي هرقل برجل أرسل به ملك غسان يخبر عن خبر رسول الله صلى الله عليه وسلم فلما استخبره هرقل قال اذهبوا فانظروا أمختتن هو أم لا فنظروا إليه فحدثوه أنه مختتن وسأله عن العرب فقال هم يختتنون فقال هرقل هذا ملك هذه الأمة قد ظهر ثم كتب هرقل إلى صاحب له برومية وكان نظيره في العلم وسار هرقل إلى حمص فلم يرم حمص حتى أتاه كتاب من صاحبه يوافق رأي هرقل على خروج النبي صلى الله عليه وسلم وأنه نبي فأذن هرقل لعظماء الروم في دسكرة له بحمص ثم أمر بأبوابها فغلقت ثم اطلع فقال يا معشر الروم هل لكم في الفلاح والرشد وأن يثبت ملككم فتبايعوا هذا النبي فحاصوا حيصة حمر الوحش إلى الأبواب فوجدوها قد غلقت فلما رأى هرقل نفرتهم وأيس من الإيمان قال ردوهم علي وقال إني قلت مقالتي آنفا أختبر بها شدتكم على دينكم فقد رأيت فسجدوا له ورضوا عنه فكان ذلك آخر شأن هرقل رواه صالح بن كيسان ويونس ومعمر عن الزهري ",
    "babWithoutTashkeel": "باب بدء الوحى",
    "ketabWithoutTashkeel": "كتاب بَدءِ الوَحْى",
    "hadeeth_order": "60",
    "YouTubeVideoID": "R2kbO-SAs5g,aVeEvBEV6no,2mcL268NHoc",
}
{
    "id": "7",
    "sndFile": "bokh00007",
    "hadeeth": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ كِتَاب الْإِيمَانِ بَاب قَوْلُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ وَهُوَ قَوْلٌ وَفِعْلٌ وَيَزِيدُ وَيَنْقُصُ قَالَ اللَّهُ تَعَالَى لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ وَزِدْنَاهُمْ هُدًى وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ وَقَوْلُهُ وَيَزْدَادَ الَّذِينَ آمَنُوا إِيمَانًا وَقَوْلُهُ أَيُّكُمْ زَادَتْهُ هَذِهِ إِيمَانًا فَأَمَّا الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا وَقَوْلُهُ جَلَّ ذِكْرُهُ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَوْلُهُ تَعَالَى وَمَا زَادَهُمْ إِلَّا إِيمَانًا وَتَسْلِيمًا وَالْحُبُّ فِي اللَّهِ وَالْبُغْضُ فِي اللَّهِ مِنْ الْإِيمَانِ وَكَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى عَدِيِّ بْنِ عَدِيٍّ إِنَّ لِلْإِيمَانِ فَرَائِضَ وَشَرَائِعَ وَحُدُودًا وَسُنَنًا فَمَنْ اسْتَكْمَلَهَا اسْتَكْمَلَ الْإِيمَانَ وَمَنْ لَمْ يَسْتَكْمِلْهَا لَمْ يَسْتَكْمِلْ الْإِيمَانَ فَإِنْ أَعِشْ فَسَأُبَيِّنُهَا لَكُمْ حَتَّى تَعْمَلُوا بِهَا وَإِنْ أَمُتْ فَمَا أَنَا عَلَى صُحْبَتِكُمْ بِحَرِيصٍ وَقَالَ إِبْرَاهِيمُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي وَقَالَ مُعَاذُ بْنُ جَبَلٍ اجْلِسْ بِنَا نُؤْمِنْ سَاعَةً وَقَالَ ابْنُ مَسْعُودٍ الْيَقِينُ الْإِيمَانُ كُلُّهُ وَقَالَ ابْنُ عُمَرَ لَا يَبْلُغُ الْعَبْدُ حَقِيقَةَ التَّقْوَى حَتَّى يَدَعَ مَا حَاكَ فِي الصَّدْرِ وَقَالَ مُجَاهِدٌ شَرَعَ لَكُمْ مِنْ الدِّينِ أَوْصَيْنَاكَ يَا مُحَمَّدُ وَإِيَّاهُ دِينًا وَاحِدًا وَقَالَ ابْنُ عَبَّاسٍ شِرْعَةً وَمِنْهَاجًا سَبِيلًا وَسُنَّةً . دُعَاؤُكُمْ إِيمَانُكُمْ لِقَوْلِهِ عَزَّ وَجَلَّ قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ وَمَعْنَى الدُّعَاءِ فِي اللُّغَةِ الْإِيمَانُ ( 8 ) حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَالْحَجِّ وَصَوْمِ رَمَضَانَ",
    "bab": "باب قول النبى صلى الله عليه و سلم بنى الاسلام على خمس",
    "ketab": "كتاب الإِيمَان",
    "videoFile": "bokhV00009",
    "ketab_id": "2",
    "hadeethWithoutTashkeel": "بسم الله الرحمن الرحيم كتاب الإيمان باب قول النبي صلى الله عليه وسلم بني الإسلام على خمس وهو قول وفعل ويزيد وينقص قال الله تعالى ليزدادوا إيمانا مع إيمانهم وزدناهم هدى ويزيد الله الذين اهتدوا هدى والذين اهتدوا زادهم هدى وآتاهم تقواهم وقوله ويزداد الذين آمنوا إيمانا وقوله أيكم زادته هذه إيمانا فأما الذين آمنوا فزادتهم إيمانا وقوله جل ذكره فاخشوهم فزادهم إيمانا وقوله تعالى وما زادهم إلا إيمانا وتسليما والحب في الله والبغض في الله من الإيمان وكتب عمر بن عبد العزيز إلى عدي بن عدي إن للإيمان فرائض وشرائع وحدودا وسننا فمن استكملها استكمل الإيمان ومن لم يستكملها لم يستكمل الإيمان فإن أعش فسأبينها لكم حتى تعملوا بها وإن أمت فما أنا على صحبتكم بحريص وقال إبراهيم صلى الله عليه وسلم ولكن ليطمئن قلبي وقال معاذ بن جبل اجلس بنا نؤمن ساعة وقال ابن مسعود اليقين الإيمان كله وقال ابن عمر لا يبلغ العبد حقيقة التقوى حتى يدع ما حاك في الصدر وقال مجاهد شرع لكم من الدين أوصيناك يا محمد وإياه دينا واحدا وقال ابن عباس شرعة ومنهاجا سبيلا وسنة . دعاؤكم إيمانكم لقوله عز وجل قل ما يعبأ بكم ربي لولا دعاؤكم ومعنى الدعاء في اللغة الإيمان ( 8 ) حدثنا عبيد الله بن موسى قال أخبرنا حنظلة بن أبي سفيان عن عكرمة بن خالد عن ابن عمر رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم بني الإسلام على خمس شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة والحج وصوم رمضان",
    "babWithoutTashkeel": "باب قول النبى صلى الله عليه و سلم بنى الاسلام على خمس",
    "ketabWithoutTashkeel": "كتاب الإِيمَان",
    "hadeeth_order": "70",
    "YouTubeVideoID": "k1ArbKmw4No",
},


def handle_bukkhari_tafsir():
    ext_vid = ".flv"
    ext_aud = ".mp3"
    bukkhari = open(mwasa_data_import().joinpath("bukkhari").joinpath("bukkhari.json"), encoding="utf-8")
    data = json.load(bukkhari)
    data = data[2]["data"]
    books = {}
    babs = []

    tafsir_hadith_lista = []
    chapter_intro = ChapterInAlSaheh.objects.filter(id=1).first()
    book_intro = BookInAlSaheh.objects.filter(id=1).first()
    chapter_intro.name = "مقدمة في علم الحديث"
    chapter_intro.name_without_tashkil = "مقدمة في علم الحديث"
    chapter_intro.save()
    file_path_audio_count_exixt = 0
    file_path_video_count_exixt = 0

    file_path_audio_count = 0
    file_path_video_count = 0
    for _ in data:
        bab_name = _["bab"] if _["bab"] else _["babWithoutTashkeel"]

        chapter = ChapterInAlSaheh.objects.filter(name=bab_name).first()
        if not chapter:
            print(_)
        else:
            if not chapter.name_without_tashkil:

                chapter.name_without_tashkil = _["babWithoutTashkeel"] if _["babWithoutTashkeel"] else _["bab"]
                babs.append(chapter)

        # print(hadith.chapter.id)
        # hadith_lista.append(hadith)
        # ========
        item_hadith_tafsir_list = []
        files_lista = _["videoFile"].split("-")
        url_lista = _["YouTubeVideoID"].split(",")
        aud_file = _["sndFile"].strip().capitalize()
        # print("befor import_file audio", url, files_lista, url_lista)
        file_path_audio = get_path_audio_Albokhary_file(aud_file + ext_aud)
        if not os.path.exists(file_path_audio):
            print(file_path_audio)
            file_path_audio_count = file_path_audio_count + 1
        else:
            file_path_audio_count_exixt = file_path_audio_count_exixt + 1
        audio_added_once = False
        for file, url in zip(files_lista, url_lista):
            file = file.strip()
            url = url.strip()
            if file == "" and url == "" and audio_added_once:
                continue
            file = file.strip() + ext_vid
            file_path_video = get_path_video_Albokhary_file(file)
            # for audio
            # foldor = ["parent", "child"]

            if not os.path.exists(file_path_video):
                print("file_path, url", file_path_video, url, _["id"])
                file_path_video_count = file_path_video_count + 1
            else:
                file_path_video_count_exixt = file_path_video_count_exixt + 1
            audio_added_once = True
            # continue
            file_audio = None
            file_video = None
            if os.path.exists(file_path_audio):

                file_audio = import_file(file_path_audio, [AUDIOS, "Albokhary"])
                check_file_and_delete(file_path_audio, file_audio.path)
                print("file_audio", file_audio)

            if os.path.exists(file_path_video):
                file_video = import_file(file_path_video, [VIDEOS, "Albokhary"])
                check_file_and_delete(file_path_video, file_video.path)
                print("file_video", file_video)

            hadith_tafsir = TafsirHadithInAlSaheh(
                book_id=_["ketab_id"] if _["ketab_id"] else book_intro.id,
                chapter=chapter if chapter else chapter_intro,
                # hadith=hadith,
                video_url=url,
                video_tafsir=file_video,
                audio_tafsir=file_audio,
            )
            item_hadith_tafsir_list.append(hadith_tafsir)

        tafsir_hadith_lista.extend(item_hadith_tafsir_list)

    print("not found count  audio ", file_path_audio_count)
    print("found count  audio", file_path_audio_count_exixt)

    print("not found count  video ", file_path_video_count)
    print("found count  video", file_path_video_count_exixt)
    TafsirHadithInAlSaheh.objects.bulk_create(tafsir_hadith_lista, ignore_conflicts=True)


def handle_bukkhari_books():
    bukkhari = open(mwasa_data_import().joinpath("bukkhari").joinpath("bukkhari.json"), encoding="utf-8")
    data = json.load(bukkhari)
    data = data[2]["data"]
    books = {}
    print(len(data))
    for _ in data:

        if not books.get(_["ketab_id"].strip()):
            if _["ketab"].strip():
                books[_["ketab_id"].strip()] = BookInAlSaheh(
                    id=int(_["ketab_id"]), name=_["ketab"], name_without_tashkil=_["ketabWithoutTashkeel"]
                )

    BookInAlSaheh.objects.bulk_create(books.values())


{"id": "4", "bab_name": "باب أمور الايمان", "ketab_id": "2", "old_id": "0"},


def handle_bukkhari_bab():
    bukkhari = open(mwasa_data_import().joinpath("bukkhari").joinpath("bukkhari_bab.json"), encoding="utf-8")
    data = json.load(bukkhari)
    data = data[2]["data"]
    lista = []
    print(len(data))
    for _, idx in zip(data, range(len(data))):
        try:
            lista.append(ChapterInAlSaheh(id=_["id"], name=_["bab_name"], book_id=int(_["ketab_id"])))

        except Exception as a:
            print(idx)
            print(_)
            print(a)

    ChapterInAlSaheh.objects.bulk_create(lista)


class Command(BaseCommand):
    def handle(self, **options):
        # handle_bukkhari_books()
        # handle_bukkhari_bab()
        # handle_bukkhari()
        handle_bukkhari_tafsir()

        # TafsirHadithInAlSaheh()
